IdeaRS.OpenModel.Concrete.Load.LoadingULS
Loading ULS

IdeaRS.OpenModel.Concrete.Load.LoadingULS.#ctor
Constructor

IdeaRS.OpenModel.Concrete.Load.LoadingULS.InternalForces
Internal force in section (permanent for staged section)

IdeaRS.OpenModel.Concrete.Load.LoadingULS.InternalForcesVariable
Variable internal force in staged section only

IdeaRS.OpenModel.Concrete.Load.LoadingULS.InternalForcesBegin
Internal forces at the beginnig

IdeaRS.OpenModel.Concrete.Load.LoadingULS.InternalForcesEnd
Internal forces at the end

IdeaRS.OpenModel.Concrete.Load.LoadingULS.InternalForces2ndOrder
Internal forces of 2nd order effect

IdeaRS.OpenModel.Concrete.Load.LoadingULS.InternalForcesImperfection
Internal forces of imperfection effect